#            ---------            #
#            Цикл: for            #
#            ---------            #

# -------------------
# -- Функция range --
# -------------------

# Функция range генерирует объекты типа iterable, состоящие из целых чисел.

# 1. range(n)
# Генерирует iterable, содержащий последовательные числа от 0 до n-1.
print(tuple(range(10)))  # => (0, 1, 2, 3, 4, 5, 6, 7, 8, 9)

# 2. range(from, to)
# Генерирует iterable со всеми числами от from до to-1 включительно.
range(4, 10)      # => 4, 5, 6, 7, 8, 9

# 3. range(from, to, step)
# Генерирует iterable с числами от from, не превышающие to с шагом изменения step.
# Если шаг отрицателен, то from должен быть больше to.
range(4, 10, 3)   # => 4, 7
range(10, 0, -2)  # => 10, 8, 6, 4, 2

# ---------------
# -- Цикл: for --
# ---------------

# Цикл for перебирает элементы итерируемого объекта (кортеж, список, строка и в т.ч. генератор range)

for color in ('red', 'green', 'yellow'):
    print(color, 'apple')
# Напечатает:
# red apple
# green apple
# yellow apple

for i in range(1, 100, 2):
    print(i)
# Напечатает нечетные числа от 1 до 99 в столбик

for i in range(1, 11):
    for j in range(1, 11):
        print(i * j, end=' ')
    print()
# Напечатает таблицу умножения

# -- Если переменная цикла не используется в самом цикле, ее можно пропустить, написав _

for _ in range(5):
    print('Hello, world!')
# Напечатает 5 раз Hello, world!


#            -----------            #
#            Цикл: while            #
#            -----------            #

# Например, выведем все числа по возрастанию от 1 до N:
n = int(input())
i = 1
while i <= n:
    print(i)
    i = i + 1

# Или найдем минимум в последовательности (оканчивается на 0):
now = int(input())
nowMin = now
while now != 0:
    if now < nowMin:
        nowMin = now
    now = int(input())
print(nowMin)


#            -----------------------            #
#            Управляющие конструкции            #
#            -----------------------            #

# Управляющие конструкции break и continue можно использовать в циклах for и while.

# -------------------------------
# -- Оператор остановки: break --
# -------------------------------

# После выполнения break работа цикла прекращается

i = 1
while True:
    print(i)
    i = i + 1
    if i > 100:
        break

# ---------------------------
# -- Блок else после цикла --
# ---------------------------

# В Python к циклу (for или while) можно написать блок else.
# Команды в этом блоке будут выполняться, если цикл завершил свою работу
#   нормальным образом (т.е условие в какой-то момент перестало быть истинным)
# и НЕ будут выполняться только в случае, если выход из цикла произошел с помощью команды break.

# Например, напишем программу, которая определяет, содержит ли введенное пользователем число цифру 7
num = int(input())
n = num
while n != 0:
    last = n % 10
    if last == 7:
        print('Число', num, 'содержит цифру 7')
        break
    n //= 10
else:
    print('Число', num, 'не содержит цифру 7')

# Оператор continue не влияет на выполнение блока else в циклах

# ------------------------------------
# -- Оператор продолжения: continue --
# ------------------------------------

# Оператор continue начинает исполнение тела цикла заново, начиная с проверки условия

# Например, дана последовательность чисел. Вывести все положительные числа
now = -1
while now != 0:
    now = int(input())
    if now <= 0:
        continue
    print(now)
